//Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное на само себя).

Console.WriteLine("Введите число!");

int a = Convert.ToInt32(Console.ReadLine());
a = a * a;
Console.WriteLine(a);
